# Задача 2: Найдите сумму цифр трехзначного числа.
n = int(input())
a = n // 100
b = n % 10
c = (n % 100 - b) / 10
print(int(a + b + c))